[String]
10000=OK
10001=Transferring data, please wait...
10002=Unknown
10003=Retry
10004=Cancel
10005=Disconnect
10006=Connecting...
14000=Loading GPRS library failed.
14001=Creating internet connection failed!
14002=Disconnecting GPRS failed.
14003=GPRS connection disconnected.
14004=RAS Name empty.
14005=Error loading Bluedrv library.
14006=Error loading each API.
14007=Error setting inquiry.
14008=Pin code empty.
14009=Error occurred while pairing with device. Please make sure the Bluetooth settings in your phone are correct, then repair.
14010=Error occurred while setting device as default.
14011=Error occurred while getting device model name.
14012=Error occurred while reading device information.
14013=Bluetooth device or handset not found.
14014=Must get data first.
14015=The handset is currently unavailable.  Please make sure the handset's main screen is displayed, and that the handset is not currently used by other programs.
14016=Please make sure the device is well connected to the phone.
14017=Please make sure the device is well connected to the phone.
14018=Writing data back to mobile failed!
14019=Reading data from mobile failed!
14020=Deleting mobile failed.
14021=Error checking parameter.
14022=Insufficient memory.
14023=No linking device.
14024=This function is not supported.
14025=No data.
14026=Can not open the file.
14027=Unsupported file format.
14028=Invalid date/time.
14029=Error reading/writing data.
14030=Invalid data.
14031=Linking library failed.
14032=File name error or file doesn't exist!
14033=The thread is terminated!
14034=No SIM Card.
14035=Limited function.
14036=Handset no response.
14037=The cause of the error might be: 1. the handset is still in the turning on process. 2. there's an error in the SIM card.  Please click Refresh button to restart this process.
14038=Unknown error!
14039=Error connecting HF audio.
14040=Error disconnecting HF audio.
14041=Error connecting socket.
14042=Insufficient space to store data

15000=Phone Menu
15001=Please select a phone model first!
15002=%s is not connected.
15003=%s is connected.
16000=PhoneBook
17000=SMS
17001=Sender:
17002=Receiver:
17003=Message
17004=Date:
18000=File Manager
20000=Searching 
20001=%s found.
21001=Pairing with phone
21002=About to connect to your phone for the first time. If your phone requires you to specify a password, enter:
21003=1234
21005=Pairing device, please wait...(PIN=1234)
21006=Pair
21007=Searching for phones, please wait...
21008=Connecting device ,please wait...
22000=Search
22001=Mobile Phone
22002=Please make sure the Bluetooth of your phone is enabled. Start searching for phones now?
23000=Dial Pad
24000=About phone
24001=You should setup your phone to allow connecting to your navigator automatically in the future. See your phone manual for more details.
25000=Bluetooth
26000=Setup
27000=Call log
27001=Answered call
27002=Dialed call
27003=Missed call
27004=Name:
27005=Number:
27006=Date:
27007=Time:
27008=Calling...
27009=Call out
27010=Incoming call
27011=Incoming SMS
28000=Phonebook Setup
28001=Import phonebook automatically
28002=Keep phonebook in memory card
28003=SMS Setup
28004=Import message automatically
28005=Popup incoming message automatically
28006=Keep messages in memory card
28007=Hands-free Setup
28008=Hands-free startup automatically

29000=Information
29001=Phone Name:
29002=Carrier:
29003=Phone Signal:
29004=Phone Battery:

30000=Phonebook
30001=Message
30002=Call Log
30003=Phone Dialler
30004=HF On
30005=HF Off
30006=Setup
30007=Search Phone
30008=Hands-Free
30009=Connect
30010=Disconnect
30011=Bluetooth On
30012=Bluetooth Off















